Diplom2/src/Reports/ОтчетПоПроходамПоДаннымСКУД/ОтчетПоПроходамПоДаннымСКУД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПроходамПоДаннымСКУД</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Report>

Diplom2/src/InformationRegisters/ОтработанноеВремя/ОтработанноеВремя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтработанноеВремя</name>
  <resources>
    <name>Вход</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Выход</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Diplom2/src/Reports/ОтчетПоПроходамПоДаннымСКУД/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ВыбратьПериод(Команда)
    ПараметрыВыбора = Новый Структура;
    ПараметрыВыбора.Вставить("НачалоПериода", НачалоДня(Отчет.НачалоПериода));
    ПараметрыВыбора.Вставить("КонецПериода", КонецДня(Отчет.КонецПериода));
    ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
    ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, , , , , ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Не Результат = Неопределено Тогда
        Отчет.НачалоПериода = Результат.НачалоПериода;
        Отчет.КонецПериода  = Результат.КонецПериода;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    ОтработанноеВремя.Сотрудник.Фамилия КАК Фамилия,
    |    ОтработанноеВремя.Сотрудник.Имя КАК Имя,
    |    ОтработанноеВремя.Сотрудник.Отчество КАК Отчество,
    |    ОтработанноеВремя.Сотрудник.Отдел.Наименование КАК Отдел,
    |    ОтработанноеВремя.Дата КАК Дата,
    |    ОтработанноеВремя.Вход КАК Вход,
    |    ОтработанноеВремя.Выход КАК Выход,
    |    РАЗНОСТЬДАТ(ОтработанноеВремя.Вход, ОтработанноеВремя.Выход, СЕКУНДА) / 3600 КАК ЧасовОтработано
    |ИЗ
    |    РегистрСведений.ОтработанноеВремя КАК ОтработанноеВремя
    |ГДЕ
    |    ОтработанноеВремя.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
    |    И (&Отдел = """"
    |        ИЛИ ОтработанноеВремя.Сотрудник.Отдел.Наименование = &Отдел)
    |УПОРЯДОЧИТЬ ПО
    |    Отдел,
    |    Фамилия,
    |    ОтработанноеВремя.Дата";
    
    Запрос.УстановитьПараметр("ДатаНачала",   НачалоДня(Отчет.НачалоПериода));
    Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Отчет.КонецПериода));
    Запрос.УстановитьПараметр("Отдел",         Отчет.Подразделение);
    
    Результат = Запрос.Выполнить();
    Таблица   = Результат.Выгрузить();
    
    ТабДокумент.Очистить();
    
    // Ширина колонок
    ТабДокумент.Область("C1").ШиринаКолонки = 20;
    ТабДокумент.Область("C2").ШиринаКолонки = 35;
    ТабДокумент.Область("C3").ШиринаКолонки = 15;
    ТабДокумент.Область("C4").ШиринаКолонки = 12;
    ТабДокумент.Область("C5").ШиринаКолонки = 12;
    ТабДокумент.Область("C6").ШиринаКолонки = 18;
    
    // Цвета для тёмной темы
    ЦветФонЗаголовка  = Новый Цвет(40,  40,  40);   // тёмно-серый
    ЦветТекстЗаголовка = Новый Цвет(180, 210, 255);  // голубоватый белый
    ЦветФонОтдела     = Новый Цвет(50,  50,  60);    // тёмно-синеватый
    ЦветТекстОтдела   = Новый Цвет(255, 200, 80);    // жёлтый акцент
    ЦветФонСтроки1    = Новый Цвет(30,  30,  30);    // почти чёрный
    ЦветФонСтроки2    = Новый Цвет(45,  45,  45);    // чуть светлее
    ЦветТекстОбычный  = Новый Цвет(220, 220, 220);   // светло-серый
    ЦветТекстЧасы     = Новый Цвет(100, 220, 150);   // зелёный акцент
    
    ШрифтЗаголовок   = Новый Шрифт(, 10, Истина);
    ШрифтОтдел       = Новый Шрифт(, 10, Истина);
    ШрифтОбычный     = Новый Шрифт(, 10, Ложь);
    
    // Заголовки
    МассивЗаголовков = Новый Массив;
    МассивЗаголовков.Добавить("Отдел");
    МассивЗаголовков.Добавить("Сотрудник");
    МассивЗаголовков.Добавить("Дата");
    МассивЗаголовков.Добавить("Вход");
    МассивЗаголовков.Добавить("Выход");
    МассивЗаголовков.Добавить("Часов отработано");
    
    Для Ном = 0 По МассивЗаголовков.ВГраница() Цикл
        Ячейка            = ТабДокумент.Область(1, Ном + 1);
        Ячейка.Текст      = МассивЗаголовков[Ном];
        Ячейка.ЦветФона   = ЦветФонЗаголовка;
        Ячейка.ЦветТекста = ЦветТекстЗаголовка;
        Ячейка.Шрифт      = ШрифтЗаголовок;
    КонецЦикла;
    
    ТекСтрока   = 2;
    ТекОтдел    = "";
    НомерСтроки = 0;
    
    Для Каждого Строка Из Таблица Цикл
        
        // Строка отдела
        Если Строка.Отдел <> ТекОтдел Тогда
            ТекОтдел    = Строка.Отдел;
            НомерСтроки = 0;
            Для К = 1 По 6 Цикл
                Яч            = ТабДокумент.Область(ТекСтрока, К);
                Яч.ЦветФона   = ЦветФонОтдела;
                Яч.ЦветТекста = ЦветТекстОтдела;
                Яч.Шрифт      = ШрифтОтдел;
            КонецЦикла;
            ТабДокумент.Область(ТекСтрока, 1).Текст = "  " + ВРег(ТекОтдел);
            ТекСтрока = ТекСтрока + 1;
        КонецЕсли;
        
        // Чередование строк
        НомерСтроки = НомерСтроки + 1;
        ЦветФон = ?(НомерСтроки % 2 = 0, ЦветФонСтроки2, ЦветФонСтроки1);
        Для К = 1 По 6 Цикл
            Яч            = ТабДокумент.Область(ТекСтрока, К);
            Яч.ЦветФона   = ЦветФон;
            Яч.ЦветТекста = ЦветТекстОбычный;
            Яч.Шрифт      = ШрифтОбычный;
        КонецЦикла;
        
        ФИО = Строка.Фамилия + " " + Строка.Имя + " " + Строка.Отчество;
        
        ТабДокумент.Область(ТекСтрока, 2).Текст = ФИО;
        ТабДокумент.Область(ТекСтрока, 3).Текст = Формат(Строка.Дата,  "ДФ=dd.MM.yyyy");
        ТабДокумент.Область(ТекСтрока, 4).Текст = Формат(Строка.Вход,  "ДФ=HH:mm");
        ТабДокумент.Область(ТекСтрока, 5).Текст = Формат(Строка.Выход, "ДФ=HH:mm");
        
        // Часы — зелёный акцент
        ЯчЧасы            = ТабДокумент.Область(ТекСтрока, 6);
        ЯчЧасы.Текст      = Формат(Строка.ЧасовОтработано, "ЧДЦ=2") + " ч";
        ЯчЧасы.ЦветТекста = ЦветТекстЧасы;
        ЯчЧасы.Шрифт      = ШрифтЗаголовок;
        
        ТекСтрока = ТекСтрока + 1;
        
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Отчет.НачалоПериода = НачалоМесяца(ТекущаяДата());
    Отчет.КонецПериода  = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПодразделенийНаСервере()
    МассивПодразделений = Новый Массив;
    Выборка = Справочники.Отделы.Выбрать();
    Пока Выборка.Следующий() Цикл
        МассивПодразделений.Добавить(Выборка.Наименование);
    КонецЦикла;
    Возврат МассивПодразделений;
КонецФункции
